In [1]:
import pandas as pd
import numpy as np

# 读取文件与保存

In [11]:
'''
    read_csv
'''
# 读取csv
data = pd.read_csv('data1.csv',encoding = 'gbk')
data

                                                name   age  count
0                                               罗纳尔多  33.0    4.0
1                                                 梅西  30.0    1.0
2                                                姆巴佩  18.0    4.0
3                                                ...   NaN    NaN

In [8]:
# 读取文本
data2 = pd.read_csv('data1.txt',sep = '::',engine='python')
data2

      name  age  count
0  ronaldo   33      4
1    messi   30      1
2  mubapei   18      4

In [9]:
# 读取Excel
data3 = pd.read_excel('data1.xlsx')
data3

      name  age  count
0  ronaldo   33      4
1    messi   30      1
2  mubapei   18      4

In [12]:
'''
    保存文件
'''
data3['name'] = ['C罗纳尔多','梅西','姆巴佩']
data3

    name  age  count
0  C罗纳尔多   33      4
1     梅西   30      1
2    姆巴佩   18      4

In [21]:
# 保存文件为football.csv
data3.to_csv('football.csv',index = False,header = None)

In [24]:
football = pd.read_csv('football.csv',encoding = 'gbk',header = None , names = ['a','b','c'])
football

       a   b  c
0  C罗纳尔多  33  4
1     梅西  30  1
2    姆巴佩  18  4

In [27]:
'''
    数据的过滤与获取
'''
football.columns[:2]

Index(['a', 'b'], dtype='object')

In [28]:
football[football.columns[:2]]

       a   b
0  C罗纳尔多  33
1     梅西  30
2    姆巴佩  18

In [30]:
'''
    缺失值处理
'''
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('ABCD'),columns = list('abcd'))
df01.loc['B','c'] = np.NaN
df01.loc['C','b'] = np.NaN
df01

   a    b    c  d
A  1  7.0  8.0  3
B  6  4.0  NaN  7
C  3  NaN  7.0  1
D  2  5.0  7.0  8

In [32]:
df01['b'].isnull()

A    False
B    False
C     True
D    False
Name: b, dtype: bool

In [33]:
'''
    dropna
'''
df01.dropna()  # 默认会删除带有 NaN 的行  只要包含一个就整行删除

   a    b    c  d
A  1  7.0  8.0  3
D  2  5.0  7.0  8

In [34]:
df01.dropna(axis = 1)    # 删除列中带有NaN的列

   a  d
A  1  3
B  6  7
C  3  1
D  2  8

In [39]:
# 设置阀值
df01 = df01.dropna(how = 'all')   # 只删除整行为  nan的行
df01

     a    b    c    d
A  1.0  7.0  8.0  3.0
B  6.0  4.0  NaN  7.0
C  3.0  NaN  7.0  1.0
D  2.0  5.0  7.0  8.0

In [36]:
df01.loc['E'] = np.NaN
df01

     a    b    c    d
A  1.0  7.0  8.0  3.0
B  6.0  4.0  NaN  7.0
C  3.0  NaN  7.0  1.0
D  2.0  5.0  7.0  8.0
E  NaN  NaN  NaN  NaN

In [43]:
'''
    fillna  处理
'''
df01.fillna(0)  # 将所有的 nan 数据替换成了 0

     a    b    c    d
A  1.0  7.0  8.0  3.0
B  6.0  4.0  0.0  7.0
C  3.0  0.0  7.0  1.0
D  2.0  5.0  7.0  8.0

In [45]:
df01

     a    b    c    d
A  1.0  7.0  8.0  3.0
B  6.0  4.0  NaN  7.0
C  3.0  NaN  7.0  1.0
D  2.0  5.0  7.0  8.0

In [44]:
df01.fillna(method = 'ffill')   # 根据前一个值进行替换

     a    b    c    d
A  1.0  7.0  8.0  3.0
B  6.0  4.0  8.0  7.0
C  3.0  4.0  7.0  1.0
D  2.0  5.0  7.0  8.0

In [46]:
df01.fillna(method = 'bfill')   # 根据后一个值进行替换

     a    b    c    d
A  1.0  7.0  8.0  3.0
B  6.0  4.0  7.0  7.0
C  3.0  5.0  7.0  1.0
D  2.0  5.0  7.0  8.0

In [47]:
df01.fillna({'b':100,'c':200})   # 根据列进行替换

     a      b      c    d
A  1.0    7.0    8.0  3.0
B  6.0    4.0  200.0  7.0
C  3.0  100.0    7.0  1.0
D  2.0    5.0    7.0  8.0

In [49]:
df01.replace({np.NaN:'hahah',1:'heiheih'})   # 根据值进行替换

         a      b      c        d
A  heiheih      7      8        3
B        6      4  hahah        7
C        3  hahah      7  heiheih
D        2      5      7        8

# 常用统计函数

In [55]:
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('ABCD'),columns = list('abcd'))
df01

   a  b  c  d
A  6  7  8  2
B  4  5  4  7
C  3  1  7  8
D  5  2  6  2

In [56]:
'''
    count
'''
df01.count()

a    4
b    4
c    4
d    4
dtype: int64

In [57]:
df01.count(axis = 1)

A    4
B    4
C    4
D    4
dtype: int64

In [53]:
ser01 = pd.Series(np.random.randint(1,5,6),index = list('abcedf'))
ser01

a    4
b    3
c    2
e    2
d    1
f    2
dtype: int32

In [54]:
ser01.count()  # 统计数量

6

In [58]:
'''
    describe
'''
df01.describe()

              a         b         c         d
count  4.000000  4.000000  4.000000  4.000000
mean   4.500000  3.750000  6.250000  4.750000
std    1.290994  2.753785  1.707825  3.201562
min    3.000000  1.000000  4.000000  2.000000
25%    3.750000  1.750000  5.500000  2.000000
50%    4.500000  3.500000  6.500000  4.500000
75%    5.250000  5.500000  7.250000  7.250000
max    6.000000  7.000000  8.000000  8.000000

In [59]:
'''
    min
'''
df01.min()

a    3
b    1
c    4
d    2
dtype: int32

In [60]:
df01.min(axis = 1)

A    2
B    4
C    1
D    2
dtype: int32

In [62]:
'''
    idmin
'''
df01.idxmin()

a    C
b    C
c    B
d    A
dtype: object

In [63]:
'''
    sum
'''
df01.sum()

a    18
b    15
c    25
d    19
dtype: int64

In [65]:
df01.mad()  # 平均绝对距离差

a    1.00
b    2.25
c    1.25
d    2.75
dtype: float64

In [66]:
'''
    cumsum
'''
df01.cumsum()

    a   b   c   d
A   6   7   8   2
B  10  12  12   9
C  13  13  19  17
D  18  15  25  19

In [68]:
df01.pct_change()

          a         b         c         d
A       NaN       NaN       NaN       NaN
B -0.333333 -0.285714 -0.500000  2.500000
C -0.250000 -0.800000  0.750000  0.142857
D  0.666667  1.000000 -0.142857 -0.750000

In [69]:
df01

   a  b  c  d
A  6  7  8  2
B  4  5  4  7
C  3  1  7  8
D  5  2  6  2

# 相关系数与协方差

In [74]:
df01 = pd.DataFrame({
    'kill':[5,6,7,8],
    'duanwei':[4,2,3,1]
})
df01

   duanwei  kill
0        4     5
1        2     6
2        3     7
3        1     8

In [75]:
df01['kill'].cov(df01['duanwei'])

-1.3333333333333333

In [76]:
df01['kill'].corr(df01['duanwei'])

-0.79999999999999993

# 唯一值、值计数、成员资格

In [77]:
ser01 = pd.Series(np.random.randint(1,5,6),index = list('abcedf'))
ser01

a    2
b    2
c    3
e    4
d    2
f    3
dtype: int32

In [78]:
ser01.unique()

array([2, 3, 4], dtype=int64)

In [81]:
ser01.value_counts()   # 查看该值出现的次数

2    3
3    2
4    1
dtype: int64

In [83]:
ser01.isin([2,3])

a     True
b     True
c     True
e    False
d     True
f     True
dtype: bool

In [84]:
ser01.index.isin(['a','b'])

array([ True,  True, False, False, False, False], dtype=bool)

In [85]:
ser01[ser01.index.isin(['a','b'])]

a    2
b    2
dtype: int32

In [90]:
df01 = pd.DataFrame({
    'movie_name':list('abadcebe'),
    'rating':[4,5,3,5,3,4,3,5]
})
df01

  movie_name  rating
0          a       4
1          b       5
2          a       3
3          d       5
4          c       3
5          e       4
6          b       3
7          e       5

In [91]:
df01['movie_name'].unique()

array(['a', 'b', 'd', 'c', 'e'], dtype=object)

In [93]:
df01['movie_name'].value_counts().head(3)

b    2
e    2
a    2
Name: movie_name, dtype: int64

In [94]:
df01['movie_name'].isin(['a','b'])

0     True
1     True
2     True
3    False
4    False
5    False
6     True
7    False
Name: movie_name, dtype: bool

# 层次索引

In [95]:
ser01 = pd.Series([30,33,35,18,20,30],index = [
    [2017,2017,2017,2018,2018,2018],
    ['messi','cr7','nermaer','messi','cr7','nermaer']
])
ser01

2017  messi      30
      cr7        33
      nermaer    35
2018  messi      18
      cr7        20
      nermaer    30
dtype: int64

In [98]:
# 获取数据
ser01[2017]['messi']

30

In [105]:
ser01[2018]['cr7']

20

In [106]:
ser01[:,'nermaer']

2017    35
2018    30
dtype: int64

In [109]:
ser01 = ser01.swaplevel().sort_index()
ser01

cr7      2017    33
         2018    20
messi    2017    30
         2018    18
nermaer  2017    35
         2018    30
dtype: int64

In [113]:
ser01[:,2017]

cr7        33
messi      30
nermaer    35
dtype: int64

In [118]:
# 转换成dataFrame
ser01 = ser01.unstack(level = 1)
ser01

         2017  2018
cr7        33    20
messi      30    18
nermaer    35    30

In [120]:
ser01.stack()

cr7      2017    33
         2018    20
messi    2017    30
         2018    18
nermaer  2017    35
         2018    30
dtype: int64

In [133]:
'''
    dataframe
'''
df01 = pd.DataFrame({
    'year':[2017,2017,2017,2018,2018,2018],
    'goal':[30,30,31,28,29,30],
    'name':['messi','cr7','nermaer','messi','cr7','nermaer']
})
df01

   goal     name  year
0    30    messi  2017
1    30      cr7  2017
2    31  nermaer  2017
3    28    messi  2018
4    29      cr7  2018
5    30  nermaer  2018

In [134]:
df01 = df01.set_index(['year','name'])
df01

              goal
year name
2017 messi      30
     cr7        30
     nermaer    31
2018 messi      28
     cr7        29
     nermaer    30

In [150]:
df01.loc[2017,'messi']

goal    30
Name: (2017, messi), dtype: int64

In [151]:
df01.loc[2017,'messi']['goal']

30

In [154]:

df02 = df01.unstack()
df02

     goal
name  cr7 messi nermaer
year
2017   30    30      31
2018   29    28      30

In [156]:
df01= df02.stack()
df01

              goal
year name
2017 cr7        30
     messi      30
     nermaer    31
2018 cr7        29
     messi      28
     nermaer    30

In [162]:
df01.sum(level = 'year')

      goal
year
2017    91
2018    87

In [164]:
df01.sum(level = 'name')

         goal
name
cr7        59
messi      58
nermaer    61

# 排序

In [165]:
'''
    sort_index
'''
ser01 = pd.Series([1,2,3,4,5],index = list('bdcae'))
ser01

b    1
d    2
c    3
a    4
e    5
dtype: int64

In [169]:
ser01.sort_index(ascending = True)   # 通过索引进行排序

a    4
b    1
c    3
d    2
e    5
dtype: int64

In [171]:
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('BCDA'),columns = list('cadb'))
df01

   c  a  d  b
B  6  7  7  7
C  6  2  7  7
D  3  7  1  4
A  6  6  2  1

In [173]:
df01.sort_index(axis = 0)  # 默认对行索引进行排序

   c  a  d  b
A  6  6  2  1
B  6  7  7  7
C  6  2  7  7
D  3  7  1  4

In [174]:
df01.sort_index(axis = 1)

   a  b  c  d
B  7  7  6  7
C  2  7  6  7
D  7  4  3  1
A  6  1  6  2

In [175]:
'''
   sort_values 
'''
ser01 = pd.Series([4,5,2,7,1],index = list('bdcae'))
ser01

b    4
d    5
c    2
a    7
e    1
dtype: int64

In [177]:
ser01.sort_values(ascending = False)   # 倒序

a    7
d    5
b    4
c    2
e    1
dtype: int64

In [178]:
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('BCDA'),columns = list('cadb'))
df01

   c  a  d  b
B  6  2  2  6
C  7  4  4  7
D  3  7  3  7
A  2  7  6  4

In [185]:
df01.sort_values(by = ['a','c'],ascending = False)

   c  a  d  b
D  3  7  3  7
A  2  7  6  4
C  7  4  4  7
B  6  2  2  6

In [186]:
'''
    rank
'''
ser01 = pd.Series([4,5,2,2,1],index = list('bdcae'))
ser01

b    4
d    5
c    2
a    2
e    1
dtype: int64

In [187]:
ser01.rank()   # 2 ，3   2.5

b    4.0
d    5.0
c    2.5
a    2.5
e    1.0
dtype: float64

In [188]:
ser01.rank(method = 'min')

b    4.0
d    5.0
c    2.0
a    2.0
e    1.0
dtype: float64

In [189]:
ser01.rank(method = 'max')

b    4.0
d    5.0
c    3.0
a    3.0
e    1.0
dtype: float64

In [190]:
ser01.rank(method = 'first')

b    4.0
d    5.0
c    2.0
a    3.0
e    1.0
dtype: float64

# 时间序列

In [192]:
pd.date_range(start = '20180701',end = '20180708')

DatetimeIndex(['2018-07-01', '2018-07-02', '2018-07-03', '2018-07-04',
               '2018-07-05', '2018-07-06', '2018-07-07', '2018-07-08'],
              dtype='datetime64[ns]', freq='D')

In [194]:
pd.date_range(start = '20180701',end = '20180708',freq = '2d')

DatetimeIndex(['2018-07-01', '2018-07-03', '2018-07-05', '2018-07-07'], dtype='datetime64[ns]', freq='2D')

In [196]:
pd.date_range(start = '20180701',end = '20180708',freq = '12h')

DatetimeIndex(['2018-07-01 00:00:00', '2018-07-01 12:00:00',
               '2018-07-02 00:00:00', '2018-07-02 12:00:00',
               '2018-07-03 00:00:00', '2018-07-03 12:00:00',
               '2018-07-04 00:00:00', '2018-07-04 12:00:00',
               '2018-07-05 00:00:00', '2018-07-05 12:00:00',
               '2018-07-06 00:00:00', '2018-07-06 12:00:00',
               '2018-07-07 00:00:00', '2018-07-07 12:00:00',
               '2018-07-08 00:00:00'],
              dtype='datetime64[ns]', freq='12H')

In [201]:
pd.date_range(start = '20180701',periods = 10,freq = '10min')

DatetimeIndex(['2018-07-01 00:00:00', '2018-07-01 00:10:00',
               '2018-07-01 00:20:00', '2018-07-01 00:30:00',
               '2018-07-01 00:40:00', '2018-07-01 00:50:00',
               '2018-07-01 01:00:00', '2018-07-01 01:10:00',
               '2018-07-01 01:20:00', '2018-07-01 01:30:00'],
              dtype='datetime64[ns]', freq='10T')

In [202]:
pd.date_range(start = '20180701',periods = 10,freq = '10s')

DatetimeIndex(['2018-07-01 00:00:00', '2018-07-01 00:00:10',
               '2018-07-01 00:00:20', '2018-07-01 00:00:30',
               '2018-07-01 00:00:40', '2018-07-01 00:00:50',
               '2018-07-01 00:01:00', '2018-07-01 00:01:10',
               '2018-07-01 00:01:20', '2018-07-01 00:01:30'],
              dtype='datetime64[ns]', freq='10S')

In [205]:
pd.date_range(start = '20180701',periods = 5,freq = 'm')

DatetimeIndex(['2018-07-31', '2018-08-31', '2018-09-30', '2018-10-31',
               '2018-11-30'],
              dtype='datetime64[ns]', freq='M')

# 表合并

In [208]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'key':list('abcde')
})
df02 = pd.DataFrame({
    'data2':[1,2,3,4,5],
    'key':list('abcde')
})
print(df01)
print(df02)

   data1 key
0      1   a
1      2   b
2      3   c
3      4   d
4      5   e
   data2 key
0      1   a
1      2   b
2      3   c
3      4   d
4      5   e

In [212]:
'''
    merge
'''
pd.merge(df01,df02,on = 'key',how = 'inner')

   data1 key  data2
0      1   a      1
1      2   b      2
2      3   c      3
3      4   d      4
4      5   e      5

In [216]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'key':list('abcde')
})
df02 = pd.DataFrame({
    'data2':[1,2,3,4,5],
    'key':list('abcfg')
})
print(df01)
print(df02)

   data1 key
0      1   a
1      2   b
2      3   c
3      4   d
4      5   e
   data2 key
0      1   a
1      2   b
2      3   c
3      4   f
4      5   g

In [217]:
pd.merge(df01,df02,on = 'key',how = 'inner')

   data1 key  data2
0      1   a      1
1      2   b      2
2      3   c      3

In [218]:
pd.merge(df01,df02,on = 'key',how = 'left')

   data1 key  data2
0      1   a    1.0
1      2   b    2.0
2      3   c    3.0
3      4   d    NaN
4      5   e    NaN

In [219]:
pd.merge(df01,df02,on = 'key',how = 'right')

   data1 key  data2
0    1.0   a      1
1    2.0   b      2
2    3.0   c      3
3    NaN   f      4
4    NaN   g      5

In [220]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'key1':list('abcde')
})
df02 = pd.DataFrame({
    'data2':[1,2,3,4,5],
    'key2':list('abcfg')
})
print(df01)
print(df02)

   data1 key1
0      1    a
1      2    b
2      3    c
3      4    d
4      5    e
   data2 key2
0      1    a
1      2    b
2      3    c
3      4    f
4      5    g

In [221]:
pd.merge(df01,df02,left_on = 'key1',right_on = 'key2',how = 'inner')

   data1 key1  data2 key2
0      1    a      1    a
1      2    b      2    b
2      3    c      3    c

In [222]:
pd.merge(df01,df02,left_on = 'key1',right_on = 'key2',how = 'left')

   data1 key1  data2 key2
0      1    a    1.0    a
1      2    b    2.0    b
2      3    c    3.0    c
3      4    d    NaN  NaN
4      5    e    NaN  NaN

In [227]:
'''
    concat
'''
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'key':list('abcde')
})
df02 = pd.DataFrame({
    'data2':[1,2,3,4,5],
    'key':list('abcfg')
})
print(df01)
print(df02)

   data1 key
0      1   a
1      2   b
2      3   c
3      4   d
4      5   e
   data2 key
0      1   a
1      2   b
2      3   c
3      4   f
4      5   g

In [228]:
pd.concat([df01,df02],join = 'outer')  # 纵向合并

   data1  data2 key
0    1.0    NaN   a
1    2.0    NaN   b
2    3.0    NaN   c
3    4.0    NaN   d
4    5.0    NaN   e
0    NaN    1.0   a
1    NaN    2.0   b
2    NaN    3.0   c
3    NaN    4.0   f
4    NaN    5.0   g

In [229]:
pd.concat([df01,df02],axis = 1,join = 'outer')   # 横向合并

   data1 key  data2 key
0      1   a      1   a
1      2   b      2   b
2      3   c      3   c
3      4   d      4   f
4      5   e      5   g

# 分组

In [27]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'data2':[10,20,30,40,50],
    'key1':list('aabba'),
    'sex':list('mwwmm')
    
})
df01

   data1  data2 key1 sex
0      1     10    a   m
1      2     20    a   w
2      3     30    b   w
3      4     40    b   m
4      5     50    a   m

In [3]:
df01.groupby('key1')

In [4]:
for i in df01.groupby('key1'):
    print(i[1])

   data1  data2 key1 sex
0      1     10    a   m
1      2     20    a   w
4      5     50    a   m
   data1  data2 key1 sex
2      3     30    b   w
3      4     40    b   m

In [5]:
df01.groupby('key1')['data1'].mean()

key1
a    2.666667
b    3.500000
Name: data1, dtype: float64

In [6]:
df01.groupby('key1')['data1'].max()

key1
a    5
b    4
Name: data1, dtype: int64

In [7]:
df01.groupby(['key1','sex'])['data1'].max()

key1  sex
a     m      5
      w      2
b     m      4
      w      3
Name: data1, dtype: int64

In [10]:
'''
    apply
'''

df01.groupby(['sex'])['data1'].apply(lambda x : x+10)

0    11
1    12
2    13
3    14
4    15
Name: data1, dtype: int64

In [11]:
df01.groupby(['key1','sex'])['data1'].apply(lambda x : x.max())

key1  sex
a     m      5
      w      2
b     m      4
      w      3
Name: data1, dtype: int64

In [28]:
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('ABCD'),columns = list('abcd'))
df01

   a  b  c  d
A  1  5  1  2
B  6  3  7  2
C  5  4  3  2
D  8  4  8  7

In [29]:
df01.apply(lambda x :x +10)

    a   b   c   d
A  11  15  11  12
B  16  13  17  12
C  15  14  13  12
D  18  14  18  17

In [30]:
def f1(x):
    return x*10

df01.apply(f1)

    a   b   c   d
A  10  50  10  20
B  60  30  70  20
C  50  40  30  20
D  80  40  80  70

In [31]:
df01

   a  b  c  d
A  1  5  1  2
B  6  3  7  2
C  5  4  3  2
D  8  4  8  7

In [33]:
def f2(x):
    if x['a'] == 1:
        x['a'] = 200
    return x


df01.apply(f2,axis = 1)

     a  b  c  d
A  200  5  1  2
B    6  3  7  2
C    5  4  3  2
D    8  4  8  7

In [36]:
df01

     a  b  c  d
A  200  5  1  2
B    6  3  7  2
C    5  4  3  2
D    8  4  8  7

In [37]:
# 传递参数
def f2(x,y):
    if x['a'] == 200:
        x['a'] = str(x['a'])+ y
    return x


df01.apply(f2,args = ('hahha',),axis = 1)

          a  b  c  d
A  200hahha  5  1  2
B         6  3  7  2
C         5  4  3  2
D         8  4  8  7

In [39]:
'''
    练习一：
    要求：提取数据时间部分，返回对应的每行数据的年、月、日三列数据。效果如右下图所示。
'''
df02 = pd.DataFrame(np.random.randint(1,9,(4,4)),columns = list('ABCD'))
df02['E'] = pd.date_range(start = '20180702',periods = 4,ferq = 'd')
df02

   A  B  C  D          E
0  6  4  8  1 2018-07-02
1  1  2  2  5 2018-07-03
2  1  7  5  1 2018-07-04
3  4  3  1  1 2018-07-05

In [57]:
import time
def get_time(x):
    # 转换时间元组
    tup_time = time.strptime(str(x),'%Y-%m-%d %H:%M:%S')
    return pd.Series([tup_time.tm_year,tup_time.tm_mon,tup_time.tm_mday],index = list('YMD'))   # 使用Series返回 生成DataFrame

In [58]:
df02['E'].apply(get_time)

      Y  M  D
0  2018  7  2
1  2018  7  3
2  2018  7  4
3  2018  7  5

In [59]:
'''
    练习二
    
'''
df6 = pd.DataFrame({
    'name':['joe', 'susan', 'anne', 'black', 'monika','ronaldo','leonarldo','tom','yilianna','bulanni'],
    'age':[19,19,18,20,20,18,19,20,18,19],
    'sex':['man','women','women','man','women','man','man','man','women','women'],
    'address':['上海','北京','上海','北京','北京','上海','北京','上海','北京','上海'],
    'money':[8000,8500,7000,9000,10000,7500,8800,9300,12000,11000]
})
df6

  address  age  money       name    sex
0      上海   19   8000        joe    man
1      北京   19   8500      susan  women
2      上海   18   7000       anne  women
3      北京   20   9000      black    man
4      北京   20  10000     monika  women
5      上海   18   7500    ronaldo    man
6      北京   19   8800  leonarldo    man
7      上海   20   9300        tom    man
8      北京   18  12000   yilianna  women
9      上海   19  11000    bulanni  women

In [63]:
# 根据地区进行分组   查看平均年龄和工资
def f1(x):
    return x.mean()

df6.groupby('address')['age','money'].apply(f1)

          age   money
address
上海       18.8  8560.0
北京       19.2  9660.0

In [64]:
# 根据年龄进行分组   查看平均工资
df6.groupby('age')['money'].apply(f1)

age
18    8833.333333
19    9075.000000
20    9433.333333
Name: money, dtype: float64

In [65]:
# 根据性别进行分组   查看平均工资
df6.groupby('sex')['money'].apply(f1)

sex
man      8520.0
women    9700.0
Name: money, dtype: float64

In [66]:
# 先根据地区，然后在根据性别进行分组，查看各地区不同性别的平均工资
df6.groupby(['address','sex'])['money'].apply(f1)

address  sex
上海       man       8266.666667
         women     9000.000000
北京       man       8900.000000
         women    10166.666667
Name: money, dtype: float64

In [72]:
#根据地区进行分组   查看工资的平均值 
#最低值 最高值 和最高值与最低值的差
#agg()分组函数 可以同时应用多个聚合函数

def y(x):
    return x.max() - x.min()


df6.groupby(['address'])['money'].agg(['mean','max','min',('cha',y)])

         mean    max   min   cha
address
上海       8560  11000  7000  4000
北京       9660  12000  8500  3500

In [73]:
'''
    练习三
    根据性别进行成绩排序
    计算男女比例
    计算成绩分布，每个成绩段有多少人

''' 
df = pd.DataFrame({'性别' : ['男', '女', '男', '女',
                              '男', '女', '男', '男'],
                   '成绩' : ['优秀', '优秀', '及格', '差',
                              '及格', '及格', '优秀', '差'],
                   '年龄' : [13,14,15,12,13,14,15,16]})
df

   年龄 性别  成绩
0  13  男  优秀
1  14  女  优秀
2  15  男  及格
3  12  女   差
4  13  男  及格
5  14  女  及格
6  15  男  优秀
7  16  男   差

In [74]:
# 替换成绩字段
df = df.replace({'优秀':'A','及格':'B','差':'C'})
df

   年龄 性别 成绩
0  13  男  A
1  14  女  A
2  15  男  B
3  12  女  C
4  13  男  B
5  14  女  B
6  15  男  A
7  16  男  C

In [76]:
#根据性别进行成绩排序
def sotrs(x):
    return x.sort_values(by = '成绩')


df.groupby('性别').apply(sotrs)

      年龄 性别 成绩
性别
女  1  14  女  A
   5  14  女  B
   3  12  女  C
男  0  13  男  A
   6  15  男  A
   2  15  男  B
   4  13  男  B
   7  16  男  C

In [77]:
df

   年龄 性别 成绩
0  13  男  A
1  14  女  A
2  15  男  B
3  12  女  C
4  13  男  B
5  14  女  B
6  15  男  A
7  16  男  C

In [85]:
# 计算男女比例
total = df['性别'].count()   # 获取总人数
sexs = df.groupby('性别')['性别'].count()
sexs.apply(lambda x : str(x/total*100)+'%')

性别
女    37.5%
男    62.5%
Name: 性别, dtype: object

In [88]:
# 计算成绩分布，每个成绩段有多少人
total = df['性别'].count()   # 获取总人数
score = df.groupby('成绩')['成绩'].count()
score.apply(lambda x : str(x/total*100)+'%')

成绩
A    37.5%
B    37.5%
C    25.0%
Name: 成绩, dtype: object

# 数据透视

In [101]:
df = pd.DataFrame({
    'kill':[1,2,3,4,5],
    'address':['皮卡多','圣马丁','皮卡多','圣马丁','皮卡多'],
    'help':[3,4,2,5,2],
    'sex':['m','w','m','m','w']
})
df

  address  help  kill sex
0     皮卡多     3     1   m
1     圣马丁     4     2   w
2     皮卡多     2     3   m
3     圣马丁     5     4   m
4     皮卡多     2     5   w

In [102]:
df.pivot_table(values = ['kill','help'],index = ['address'],aggfunc = np.mean)
# 通过index 进行 分组 查看 values 中的字段 的 aggfunc 值

             help  kill
address
圣马丁      4.500000   3.0
皮卡多      2.333333   3.0

In [103]:
df.groupby('address')['kill','help'].mean()

         kill      help
address
圣马丁       3.0  4.500000
皮卡多       3.0  2.333333

In [104]:
df.pivot_table(values = ['kill','help'],index = ['address'],aggfunc = [np.mean,np.max,np.min])

             mean      amax      amin
             help kill help kill help kill
address
圣马丁      4.500000  3.0    5    4    4    2
皮卡多      2.333333  3.0    3    5    2    1

In [105]:
df.pivot_table(values = ['kill','help'],index = ['address'],columns = ['sex'],aggfunc = np.mean)

        help      kill
sex        m    w    m    w
address
圣马丁      5.0  4.0  4.0  2.0
皮卡多      2.5  2.0  2.0  5.0